package HomeWork1;

public class ExerciseTwo {
    public static void main (String []agr){
       /* int a = 8;
        int resault = 5+2/a;
        int resault1 = (5+2)/a;   // 0 так как инт результат  = 0,875
        int resault2 = (5 + 2++)/a;  // Ошибка нету присвоения. нельзя присвоить 2 число 3 или любое другое так как это Литералы.
        int resault3 = (5 + 2++) / --a;  // Ошибка нету присвоения. нельзя присвоить 2 число 3 или любое другое так как это Литералы.
        boolean resault4 = (5 * 2 >> 2++) / --a; //Думаю что тип должен быть булиан так как тут идет сравнение. Но будет ошибка.Так как есть 2++ Литерал.

        boolean resault5 = (5 + 7 > 20 ? 68 : 22 * 2 >> 2++) / --a;  //Думаю что тип должен быть булиан так как тут идет сравнение.
        // Но будет ошибка.Так как есть 2++ Литерал.

        boolean resault6 = (5 + 7 > 20 ? 68 >= 68 : 22 * 2 >> 2++) / --a; // Сложный для меня пример. Решить на листике не удалось правильно.
        //Думаю причина не работы точно такая же как и раньше 2++.

        boolean resault7 = 6 - 2 > 3 && 12 * 12<= 119; //Будет False так как 12*12 = 144 а 119 не больше 144. итог с false.
        boolean resault8 =true && false;  // Если есть false То при сравнении будет false.

      */
    }
}
